Repository: doc-l10n-kit/ja-pcp-website
Catalog: l10n/tmx/pcp.tmx
Source language: en
Languages: ja_jp

source: Performance Co-Pilot is a system performance analysis toolkit.
ja_jp: Performance Co-Pilotはシステムパフォーマンスの分析ツールキットです。

source: Collect
ja_jp: 収集

source: <strong>Lightweight</strong> : <a href="/features.html#collect">Collect</a> performance metrics from your systems efficiently.
ja_jp: <strong>軽量</strong>: システムのパフォーマンスメトリクスを効率的に<a href="/features.html#collect">収集</a>します。

source: <strong>Distributed</strong> : Collate metrics from <a href="/features.html#distributed">multiple hosts</a> and a variety of operating systems.
ja_jp: <strong>分散</strong>:<a href="/features.html#distributed">複数のホスト</a>や様々なOSからのメトリクスを照合します。

source: <strong>Included</strong> : Everything you need is already included in the major distributions: Fedora, RHEL, Debian, SUSE, Ubuntu, Gentoo
ja_jp: <strong>組込済</strong>: 主要なディストリビューション:Fedora, RHEL, Debian, SUSE, Ubuntu, Gentooで必要なものがすべて組込済です。

source: Analyze
ja_jp: 分析

source: <a href="/features.html#analyze">Analyze</a> systems' performance metrics in real-time or using historical data.
ja_jp: システムのパフォーマンスメトリクスをリアルタイムまたは過去のデータを使って<a href="/features.html#analyze">分析</a>します。

source: Compare performance metrics between different hosts and different intervals. Observe trends and identify abnormal patterns.
ja_jp: 異なるホストや異なる間隔でのパフォーマンスメトリクスを比較し、トレンドを観察、異常なパターンを特定します。

source: Extend
ja_jp: 拡張

source: <a href="/features.html#extend">Extend</a> the collected performance metrics in a simple way.
ja_jp: 収集したパフォーマンスメトリクスをシンプルな方法で<a href="/features.html#extend">拡張</a>します。

source: PCP offers a multitude of APIs and libraries to extract and make use of performance metrics from your own application.
ja_jp: PCPは、自身のアプリケーションからパフォーマンスメトリクスを抽出して利用するための多数のAPIとライブラリを提供しています。

source: Use Performance Co-Pilot Now
ja_jp: 今すぐPerformance Co-Pilotを使う

source: Quickstart
ja_jp: クイックスタート

source: Download
ja_jp: ダウンロード

source: Who's Using It?
ja_jp: 誰が使っているの？

source: Learn More
ja_jp: さらに詳しく

source: News
ja_jp: ニュース

source: Feb 2021 <br> PCP 5.2.5
ja_jp: 2021年2月<br>PCP 5.2.5</br>

source: New Linux ZFS, High Availability (Pacemaker) and detailed sockets metrics. <a href="https://man7.org/linux/man-pages/man1/pmproxy.1.html">pmproxy</a> memory management improvements.
ja_jp: 新しいLinux ZFS、高可用性（Pacemaker）、および詳細なソケットメトリクス。<a href="https://man7.org/linux/man-pages/man1/pmproxy.1.html">pmproxy</a>のメモリ管理の改善。

source: Dec 2020 <br> PCP 5.2.3
ja_jp: 2020年12月<br>PCP 5.2.3</br>

source: Performance improvements and process network statistics support in the <a href="https://man7.org/linux/man-pages/man1/pcp-atop.1.html">pcp-atop</a> command. Experimental <a href="https://man7.org/linux/man-pages/man1/pcp-htop.1.html">pcp-htop</a> command added. Improvements to the <a href="https://man7.org/linux/man-pages/man1/pmproxy.1.html">pmproxy</a> REST API for fast, scalable <a href="https://man7.org/linux/man-pages/man1/pmseries.1.html">pmseries</a> querying.
ja_jp: <a href="https://man7.org/linux/man-pages/man1/pcp-atop.1.html">pcp-atop</a>コマンドの性能向上とプロセスごとのネットワーク統計情報のサポート。実験的な<a href="https://man7.org/linux/man-pages/man1/pcp-htop.1.html">pcp-htop</a>コマンドを追加しました。<a href="https://man7.org/linux/man-pages/man1/pmproxy.1.html">pmproxy</a>REST APIが改良され、<a href="https://man7.org/linux/man-pages/man1/pmseries.1.html">pmseries</a>のクエリを高速かつスケーラブルに実行できるようになりました。

source: Nov 2020 <br> PCP 5.2.2
ja_jp: 2020年11月<br>PCP 5.2.2</br>

source: Minor bug fix release - especially in <a href="https://man7.org/linux/man-pages/man1/pmproxy.1.html">pmproxy</a> REST API, KVM, XFS and other Linux kernel metrics. Support for hv_gpci and hv_24x7 core-level events in the <a href="https://man7.org/linux/man-pages/man1/pmdaperfevent.1.html">perfevent</a> agent. New online version of the PCP Guides at <a href="https://pcp.readthedocs.io">readthedocs</a>
ja_jp: マイナーバグフィックスリリース - 特に<a href="https://man7.org/linux/man-pages/man1/pmproxy.1.html">pmproxy</a>REST API、KVM、XFS、その他の Linux カーネルメトリクスにおいて。<a href="https://man7.org/linux/man-pages/man1/pmdaperfevent.1.html">perfevent</a>agent で hv_gpci および hv_24x7 のコアレベルイベントをサポートしました。PCP ガイドの新しいオンライン版が<a href="https://pcp.readthedocs.io">readthedocs</a>に追加されました。

source: Sep 2020 <br> PCP 5.2.1
ja_jp: 2020年9月<br>PCP 5.2.1</br>

source: Minor bug fix release. Per-context derived metrics support, new REST APIs. Support Windows authentication mode in the <a href="https://man7.org/linux/man-pages/man1/pmdamssql.1.html">SQL Server</a> agent. Improved metric labels handling in the <a href="https://man7.org/linux/man-pages/man1/pmdaopenmetrics.1.html">OpenMetrics</a> agent, <a href="https://man7.org/linux/man-pages/man1/pcp2elasticsearch.1.html">pcp2elasticsearch</a> and <a href="https://man7.org/linux/man-pages/man1/pcp2spark.1.html">pcp2spark</a> utilities.
ja_jp: マイナーバグフィックスリリース。コンテキストごとの派生メトリクスのサポート、新しい REST API。<a href="https://man7.org/linux/man-pages/man1/pmdamssql.1.html">SQL Server</a>エージェントでWindows認証モードをサポートしました。<a href="https://man7.org/linux/man-pages/man1/pmdaopenmetrics.1.html">OpenMetrics</a>エージェント、<a href="https://man7.org/linux/man-pages/man1/pcp2elasticsearch.1.html">pcp2elasticsearch</a>、<a href="https://man7.org/linux/man-pages/man1/pcp2spark.1.html">pcp2spark</a>ユーティリティでのメトリックラベルの処理を改善しました。

source: Main Menu
ja_jp: メインメニュー

source: Developers
ja_jp: 開発者

source: Report an issue
ja_jp: 問題を報告する

source: Roadmap
ja_jp: ロードマップ

source: Contributing
ja_jp: 貢献する

source: Team
ja_jp: チーム

source: Testimonials
ja_jp: ユーザーの声

source: FAQ
ja_jp: よくある質問

source: Website
ja_jp: ウェブサイト

source: Get Social
ja_jp: ソーシャル

source: <strong>Kernel agents</strong> for each supported platform. The Linux agent exports a broad range of performance data from kernels since 2.0.36 or later. This includes coverage of activity in the areas of: CPU, disk, memory, swapping, network, NFS, RPC, filesystems, and per-process statistics.
ja_jp: サポートされている各プラットフォーム用の<strong>カーネルエージェント</strong>です。Linuxエージェントは、2.0.36以降のカーネルから広範なパフォーマンスデータをエクスポートします。これには以下の分野のアクティビティが含まれます。CPU、ディスク、メモリ、スワップ、ネットワーク、NFS、RPC、ファイルシステム、プロセスごとの統計などです。

source: <strong>Other agents</strong> export performance data from: Databases, Log files, Web servers, Mail systems, Cisco routers, Search engines, Cluster infrastructure, Application instrumentation (including the JVM) and the PCP infrastructure itself.
ja_jp: <strong>その他のエージェント</strong>は、データベース、ログファイル、ウェブサーバー、メールシステム、シスコルーター、検索エンジン、クラスターインフラストラクチャー、アプリケーション計測（JVMを含む）、PCP インフラストラクチャー自体などからパフォーマンスデータをエクスポートします。

source: Assorted simple <strong>monitoring tools</strong> that use the PCP APIs to retrieve and display either arbitrary performance metrics, or specific groups of metrics (as in pmstat, a cluster-aware vmstat lookalike).
ja_jp: シンプルな<strong>モニタリングツール</strong>の数々が PCP API を使用して任意のパフォーマンスメトリクスや特定のメトリクスグループを取得し表示します（例えばクラスター対応の vmstat 相当である pmstat のように）。

source: A single <strong>API</strong> for accessing the performance data that hides details of where the data comes from and how it was captured and imported into the PCP framework.
ja_jp: パフォーマンスデータにアクセスするための単一の<strong>API</strong>は、データがどこから来たのか、どのように取得され、PCP フレームワークに取り込まれたのかという詳細を隠します。

source: Integrated archive logging and replay so a client application can use the same API to process real-time data from a host or historical data from an archive.
ja_jp: アーカイブのロギングとリプレイが統合されているため、クライアントアプリケーションは同じ API を使ってホストからのリアルタイムデータとアーカイブからの履歴データを処理することができます。

source: The framework supports APIs and configuration file formats that enable the scope of performance monitoring to be extended at all levels.
ja_jp: このフレームワークは、パフォーマンスモニタリングの範囲をすべてのレベルで拡張できるような API や設定ファイルフォーマットをサポートしています。

source: The PCP inference engine supports automated monitoring through a rule-based language and interpreter that performs user-defined actions when rule predicates are found to be true.
ja_jp: PCP の推論エンジンは、ルールベースの言語とインタープリターによって自動モニタリングをサポートし、ルールの述語が真であったときにユーザーが定義したアクションを実行します。

source: Access the graph data through a web interface or a GUI
ja_jp: Web インターフェースや GUI でグラフデータにアクセスできます。

source: Distributed
ja_jp: 分散

source: A client-server architecture allows multiple clients to monitor the same host, and a single client to monitor multiple hosts (e.g. in a cluster). This enables centralized monitoring of distributed processing.
ja_jp: クライアントサーバーアーキテクチャでは、複数のクライアントが同じホストを監視したり、1つのクライアントが複数のホスト（クラスターなど）を監視することができます。これにより、分散した処理を集中的にモニタリングすることができます。

source: An endian-safe transport layer for moving performance metrics between the collector and the monitoring applications over TCP/IP. This means a desktop with PCP can monitor remote server systems with different architectures and operating systems.
ja_jp: エンディアンセーフなトランスポートレイヤーによって TCP/IP を介してコレクターとモニタリングアプリケーションの間でパフォーマンスメトリクスを移動させることができます。これは、PCP を搭載したデスクトップが、異なるアーキテクチャや OS を持つリモートサーバーシステムを監視できることを意味します。

source: A "plugin" framework (libraries, APIs, agents and daemon) to collect performance data from multiple sources on a single host, e.g. from the hardware, the kernel, the service layers, the application libraries, and the applications themselves.
ja_jp: 1つのホスト上で複数のソースからパフォーマンスデータを収集するための「プラグイン」フレームワーク（ライブラリ、API、エージェント、デーモン）があります。例えば、ハードウェア、カーネル、サービスレイヤー、アプリケーションライブラリ、アプリケーション自体からデータを収集できます。

source: Libraries and sample implementations encourage the development of new "plugins" (or agents) to capture and export the performance data that matters in your application environment, along side the other generic performance data.
ja_jp: ライブラリとサンプル実装によって、あなたのアプリケーション環境で重要となるパフォーマンスデータを、他の一般的なパフォーマンスデータと一緒にキャプチャしてエクスポートするための新しい「プラグイン」（またはエージェント）の開発が容易になります。

source: Features
ja_jp: 特徴

source: Documentation
ja_jp: ドキュメント

source: Installation
ja_jp: インストール

source: Quick Reference Guide
ja_jp: クイックリファレンスガイド

source: Charts Overview
ja_jp: チャートの概要

source: Time Control Overview
ja_jp: タイムコントロールの概要

source: Guides
ja_jp: ガイド

source: Users and Administrators Guide, Programmers and REST API Guides
ja_jp: ユーザー＆管理者ガイド、プログラマー＆REST API ガイド

source: Slides
ja_jp: スライド

source: Papers
ja_jp: 発表資料

source: Reference papers and presentations we have permission to reproduce.
ja_jp: 転載が許可された参考論文・発表資料。

source: Screenshots
ja_jp: スクリーンショット

source: Screenshots from a handful of PCP GUI and console tools, and the more recent <a href="https://grafana-pcp.readthedocs.io/en/latest/screenshots.html">Grafana PCP</a> plugin.
ja_jp: いくつかの PCP GUI およびコンソールツール、およびより最近の<a href="https://grafana-pcp.readthedocs.io/en/latest/screenshots.html">Grafana PCP</a>プラグインのスクリーンショット。

source: Short Guides
ja_jp: ショートガイド

source: Using Charts
ja_jp: チャートの使い方

source: Logging Basics
ja_jp: ロギングの基本

source: Automated Reasoning Basics
ja_jp: 自動推論の基礎

source: Configuring Automated Reasoning
ja_jp: 自動推論の設定

source: Secure Connections
ja_jp: 安全な接続

source: Secure Client Connections
ja_jp: 安全なクライアント接続

source: Authenticated Connections
ja_jp: 認証済みの接続

source: Importing data and creating PCP archives (C, Perl, Python)
ja_jp: データのインポートと PCP アーカイブの作成 (C、Perl、Python)

source: Case Studies
ja_jp: ケーススタディー

source: Analysing processor utilization
ja_jp: プロセッサの使用状況を分析する

source: Analysing storage performance
ja_jp: ストレージのパフォーマンスを分析する

source: System Event Log Instrumentation
ja_jp: システムイベントログの計測

source: Comparing storage performance
ja_jp: ストレージの性能を比較する

source: Management framework integration
ja_jp: マネジメントフレームワークの統合

source: Videos
ja_jp: ビデオ

source: Ansible 'metrics' Role
ja_jp: Ansible の「metric」ロール

source: Practical Performance Co-Pilot and Grafana
ja_jp: 実践的な Performance Co-Pilot と Grafana
